patchew-project/qemu/hw/mips/pic32mk_usb.c
/*
 * Microchip PIC32MK USB OTG Full-Speed controller emulation
 * Datasheet: DS60001519E §25
 * Register addresses verified against p32mk1024mcm100.h (XC32 v4.60 pack).
 *
 * Phase 4A — register-file stub (complete)
 * Phase 4B — USB enumeration simulation + CDC TX chardev output:
 *   • QEMUTimer drives the EP0 state machine (USB Reset → enumerate)
 *   • SETUP packet injection via BDT write + TRNIF interrupt
 *   • CDC TX polling: EP1-IN BDT entry harvested → chardev write
 *   • chardev property "chardev" exposes CDC output as host PTY/socket
 *
 * BDT layout (PIC32MK device mode, ping-pong off / PPBRST):
 *   Each endpoint has 4 BDT entries (RX-even, RX-odd, TX-even, TX-odd).
 *   Entry size = 8 bytes (4-byte ctrl word + 4-byte buffer address).
 *   EP0-OUT-even = offset 0x00, EP0-IN-even = offset 0x10,
 *   EP1-OUT-even = offset 0x20, EP1-IN-even = offset 0x30.
 *
 * Copyright (c) 2026 QEMU contributors
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/timer.h"
#include "qapi/error.h"
#include "hw/core/sysbus.h"
#include "hw/core/irq.h"
#include "hw/mips/pic32mk.h"
#include "hw/mips/pic32mk_usb.h"
#include "exec/cpu-common.h"   /* cpu_physical_memory_read/write */
#include "chardev/char-fe.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/qdev-properties-system.h"

/*
 * Helpers
 * -----------------------------------------------------------------------
 */

/*
 * Apply SET / CLR / INV operation.
 * sub = addr & 0xF: 0 → write, 4 → CLR, 8 → SET, C → INV
 */
static void apply_sci(uint32_t *reg, uint32_t val, int sub)
{
    switch (sub) {
    case 0x0:
        *reg  = val;
        break;
    case 0x4:
        *reg &= ~val;
        break;
    case 0x8:
        *reg |= val;
        break;
    case 0xC:
        *reg ^= val;
        break;
    }
}

/*
 * Apply write-1-clear (W1C) operation.
 */
static void apply_w1c(uint32_t *reg, uint32_t val, int sub)
{
    if (sub == 0x0 || sub == 0x4) {
        *reg &= ~val;
    }
}

static void usb_update_irq(PIC32MKUSBState *s)
{
    /*
     * SESSION_VALID (OTGIR bit 3 / SESVDIF):
     *
     * On real PIC32MK hardware, SESVDIF is edge-triggered: it fires once when
     * SESVD transitions.  To prevent an infinite ISR loop (the Harmony ISR
     * clears SESVDIF but VBUS stays valid), we use an edge-latch flag:
     * sesvd_edge_latched is set when SESVDIF is first asserted, and cleared
     * when firmware W1C-clears SESVDIF from OTGIR.  We only include SESVDIF
     * in the IRQ level calculation while the edge latch is active.
     */
    uint32_t otg_pending = s->otgir & s->otgie;
    if (!s->sesvd_edge_latched) {
        otg_pending &= ~USB_OTG_IR_SESSION_VALID;
    }

    bool fire = ((s->uir  & s->uie)  != 0)
             || ((s->ueir & s->ueie) != 0)
             || (otg_pending != 0);
    qemu_set_irq(s->irq, fire ? 1 : 0);
}

/*
 * USTAT FIFO helpers (PIC32MK has a 4-deep hardware FIFO)
 *
 * On real hardware, each completed transaction pushes an USTAT value onto
 * the FIFO and asserts TRNIF.  When firmware W1C-clears TRNIF, the FIFO
 * pops; if more entries remain, TRNIF is re-asserted immediately.
 * Without this FIFO, two transactions completing in quick succession
 * (e.g. chardev RX + timer TX poll) overwrite the single USTAT register,
 * causing the firmware to miss one transaction entirely — the root cause
 * of the write stall.
 * -----------------------------------------------------------------------
 */

static void usb_stat_fifo_push(PIC32MKUSBState *s, uint32_t stat_val)
{
    if (s->stat_fifo_count >= 4) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "pic32mk_usb: USTAT FIFO overflow (dropped 0x%02x)\n",
                      stat_val);
        return;
    }
    s->stat_fifo[s->stat_fifo_head] = stat_val;
    s->stat_fifo_head = (s->stat_fifo_head + 1) & 3;
    s->stat_fifo_count++;
    /* Expose the front of the FIFO via the USTAT register */
    s->ustat = s->stat_fifo[s->stat_fifo_tail];
    s->uir |= USB_IR_TRNIF;
}

/*
 * Pop the front entry.  Called when firmware W1C-clears TRNIF.
 * If more entries remain, re-assert TRNIF with the next USTAT value.
 */
static void usb_stat_fifo_pop(PIC32MKUSBState *s)
{
    if (s->stat_fifo_count == 0) {
        return;
    }
    s->stat_fifo_tail = (s->stat_fifo_tail + 1) & 3;
    s->stat_fifo_count--;
    if (s->stat_fifo_count > 0) {
        s->ustat = s->stat_fifo[s->stat_fifo_tail];
        s->uir |= USB_IR_TRNIF;
    }
}

/*
 * BDT helpers
 * -----------------------------------------------------------------------
 */

static hwaddr usb_bdt_phys(PIC32MKUSBState *s)
{
    /*
     * BDT base = (BDTP3[7:0] << 24) | (BDTP2[7:0] << 16) | (BDTP1[7:1] << 8)
     * BDTP1 bits [7:1] map to BDT address bits [15:9].
      */
    return ((hwaddr)(s->bdtp3 & 0xFFu) << 24)
         | ((hwaddr)(s->bdtp2 & 0xFFu) << 16)
         | ((hwaddr)(s->bdtp1 & 0xFEu) << 8);
}

/*
 * Inject an 8-byte SETUP packet into the EP0-OUT-even BDT buffer.
 * The BDT entry at offset 0x00 from BDT base must be UOWN=1 (firmware armed).
 * On success: writes the SETUP data to the buffer, clears UOWN, sets
 * TOK_PID=SETUP (0xD) in byte[0] bits[5:2]=0x34, bc=8 in shortWord[1]
 * (bits[31:16]), sets ustat=EP0/OUT/EVEN, fires TRNIF.
 *
 * BDT 32-bit control word layout (Harmony DRV_USBFS_BDT_ENTRY union):
 *   bits[ 7: 0] = byte[0]:  UOWN(7), DATA01(6), DTSEN(4), BSTALL(2), TOK_PID[5:2]
 *   bits[15: 8] = byte[1]:  (reserved / padding)
 *   bits[31:16] = shortWord[1]: byte count (BC)
 *   word[1]                  = buffer physical address
 *
 * Harmony TRNIF switch uses (byte[0] & 0x3C):
 *   0x34 → SETUP (TOK_PID=0xD)
 *   0x04 → OUT   (TOK_PID=0x1)
 *   0x24 → IN    (TOK_PID=0x9)
 */
static bool usb_inject_setup(PIC32MKUSBState *s, const uint8_t setup[8])
{
    hwaddr bdt = usb_bdt_phys(s);
    if (!bdt) {
        return false;
    }

    /* Check both ping-pong entries for EP0-OUT (even=BDT+0, odd=BDT+8). */
    for (int ppbi = 0; ppbi < 2; ppbi++) {
        hwaddr out_entry = bdt + (ppbi ? 8u : 0u);
        uint8_t entry[8];
        cpu_physical_memory_read(out_entry, entry, 8);

