patchew-project/qemu/hw/mips/pic32mk_usb.c
        uint32_t ctrl = le32_to_cpu(*(uint32_t *)entry);
        uint32_t addr = le32_to_cpu(*(uint32_t *)(entry + 4));

        if (!(ctrl & BDT_UOWN) || !addr) {
            continue;   /* not armed — try other ping-pong */
        }

        /* Write SETUP packet into the EP0-OUT buffer */
        cpu_physical_memory_write(addr, setup, 8);

        /*
         * Return BDT entry to firmware:
         *   byte[0] = 0x34: TOK_PID=SETUP(0xD) in bits[5:2], UOWN=0
         *   shortWord[1] = 8: byte count
         */
        ctrl = 0x00000034u | (8u << 16);
        *(uint32_t *)entry = cpu_to_le32(ctrl);
        cpu_physical_memory_write(out_entry, entry, 8);

        /* UxSTAT: EP=0, DIR=OUT(0), PPBI=ppbi */
        usb_stat_fifo_push(s, (uint32_t)(ppbi ? 0x04u : 0x00u));
        usb_update_irq(s);
        return true;
    }
    return false;   /* neither entry armed yet */
}

/*
 * Accept an EP0-IN response from the firmware: read the data the firmware
 * placed in EP0-IN-even (BDT offset 0x10), set TOK_PID=IN in byte[0],
 * clear UOWN, preserve bc in shortWord[1], fire TRNIF.
 * Returns true if an IN entry was accepted, false if not armed yet.
 */
static bool usb_accept_ep0_in(PIC32MKUSBState *s)
{
    hwaddr bdt = usb_bdt_phys(s);
    if (!bdt) {
        return false;
    }

    /* Check both ping-pong entries for EP0-IN (even=BDT+0x10, odd=BDT+0x18). */
    for (int ppbi = 0; ppbi < 2; ppbi++) {
        hwaddr in_entry = bdt + 0x10u + (ppbi ? 8u : 0u);
        uint8_t entry[8];
        cpu_physical_memory_read(in_entry, entry, 8);

        uint32_t ctrl = le32_to_cpu(*(uint32_t *)entry);
        if (!(ctrl & BDT_UOWN)) {
            continue;   /* not armed */
        }

        /*
         * Return BDT entry to firmware:
         *   byte[0] = 0x24: TOK_PID=IN(0x9), UOWN=0
         *   shortWord[1]: preserve bc
         */
        ctrl = (ctrl & 0xFFFF0000u) | 0x24u;
        *(uint32_t *)entry = cpu_to_le32(ctrl);
        cpu_physical_memory_write(in_entry, entry, 8);

        /* UxSTAT: EP=0, DIR=IN(bit3), PPBI=ppbi(bit2) */
        usb_stat_fifo_push(s, 0x08u | (uint32_t)(ppbi ? 0x04u : 0x00u));
        usb_update_irq(s);
        return true;
    }
    return false;
}

/*
 * Simulate the STATUS phase OUT for a control read (host→device ZLP).
 * Write EP0-OUT-even BDT entry: TOK_PID=OUT(0x1)→byte[0]=0x04, UOWN=0,
 * bc=0 in shortWord[1].  Then fire TRNIF so the Harmony TRNIF handler
 * hits case 0x04, sees shortWord[1]=0 < maxPacketSize, marks the IRP
 * complete, invokes the callback, and re-arms EP0-OUT for the next SETUP.
 */
static void usb_send_status_out(PIC32MKUSBState *s)
{
    hwaddr bdt = usb_bdt_phys(s);
    if (!bdt) {
        return;
    }

    /*
     * Find the armed EP0-OUT ping-pong entry (even=BDT+0, odd=BDT+8).
     * Write: byte[0]=0x04 (TOK_PID=OUT), UOWN=0, shortWord[1]=0 (ZLP).
     */
    for (int ppbi = 0; ppbi < 2; ppbi++) {
        hwaddr out_entry = bdt + (ppbi ? 8u : 0u);
        uint8_t entry[8];
        cpu_physical_memory_read(out_entry, entry, 8);
        uint32_t ctrl = le32_to_cpu(*(uint32_t *)entry);

        if (ctrl & BDT_UOWN) {
            ctrl = 0x00000004u;   /* TOK_PID=OUT, UOWN=0, bc=0 */
            *(uint32_t *)entry = cpu_to_le32(ctrl);
            cpu_physical_memory_write(out_entry, entry, 8);
            usb_stat_fifo_push(s, (uint32_t)(ppbi ? 0x04u : 0x00u));
            usb_update_irq(s);
            return;
        }
    }

    /* Neither armed — fire even anyway (fallback; should not happen) */
    uint8_t entry[8];
    cpu_physical_memory_read(bdt, entry, 8);
    *(uint32_t *)entry = cpu_to_le32(0x00000004u);
    cpu_physical_memory_write(bdt, entry, 8);
    usb_stat_fifo_push(s, USB_STAT_EP0_OUT_EVEN);
    usb_update_irq(s);
}

/*
 * Chardev RX callbacks (CDC Host→Device path, EP2-OUT)
 * -----------------------------------------------------------------------
 */

/*
 * Returns 64 (max bulk packet) when enumeration is done and EP2-OUT BDT
 * is armed by the firmware (UOWN=1). Returns 0 otherwise so the chardev
 * layer does not deliver data before the firmware is ready.
 */
static int usb_chr_can_receive(void *opaque)
{
    PIC32MKUSBState *s = opaque;
    if (s->ep0_sim != EP0_SIM_DONE) {
        return 0;
    }
    hwaddr bdt = usb_bdt_phys(s);
    if (!bdt) {
        return 0;
    }
    /* EP2-OUT-even = BDT+0x40, EP2-OUT-odd = BDT+0x48 */
    for (int ppbi = 0; ppbi < 2; ppbi++) {
        uint8_t entry[4];
        cpu_physical_memory_read(bdt + 0x40u + (ppbi ? 8u : 0u), entry, 4);
        uint32_t ctrl = le32_to_cpu(*(uint32_t *)entry);
        if (ctrl & BDT_UOWN) {
            return 64;
        }
    }
    return 0;
}

/*
 * Called by the QEMU chardev layer when the host sends data over the PTY/socket.
 * Writes the payload into the firmware's EP2-OUT buffer, returns the BDT entry
 * to firmware (UOWN=0, TOK_PID=OUT, bc=n), and fires TRNIF so the Harmony ISR
 * picks it up via USB_ReadByte() → circular_buf_get().
 */
static void usb_chr_receive(void *opaque, const uint8_t *buf, int size)
{
    PIC32MKUSBState *s = opaque;
    hwaddr bdt = usb_bdt_phys(s);
    if (!bdt) {
        return;
    }

    for (int ppbi = 0; ppbi < 2; ppbi++) {
        hwaddr ep2_out = bdt + 0x40u + (ppbi ? 8u : 0u);
        uint8_t entry[8];
        cpu_physical_memory_read(ep2_out, entry, 8);

        uint32_t ctrl = le32_to_cpu(*(uint32_t *)entry);
        uint32_t addr = le32_to_cpu(*(uint32_t *)(entry + 4));

        if (!(ctrl & BDT_UOWN) || !addr) {
            continue;   /* not armed — try other ping-pong */
        }

        int n = MIN(size, 64);
        cpu_physical_memory_write(addr, buf, n);

        /*
         * Return BDT entry to firmware:
         *   byte[0] = 0x04: TOK_PID=OUT(0x1) in bits[5:2], UOWN=0
         *   shortWord[1] = n: byte count received
         */
        ctrl = 0x00000004u | ((uint32_t)n << 16);
        *(uint32_t *)entry = cpu_to_le32(ctrl);
        cpu_physical_memory_write(ep2_out, entry, 8);

        /* UxSTAT: EP=2(bits[7:4]=0x20), DIR=OUT(bit3=0), PPBI=ppbi(bit2) */
        usb_stat_fifo_push(s, 0x20u | (uint32_t)(ppbi ? 0x04u : 0x00u));
        usb_update_irq(s);
        return;
    }
}

