patchew-project/qemu/hw/mips/pic32mk_usb.c
/*
 * Poll the CDC TX endpoint (EP2-IN) and the CDC notification endpoint (EP1-IN).
 * If the firmware has queued data (UOWN=1), drain it, release the BDT entry,
 * and fire TRNIF so the firmware can refill.
 *
 * EP1-IN (BDT+0x30): CDC Serial State Notification — data discarded (host-side
 * notification only), but BDT must be returned to prevent firmware stall.
 * EP2-IN (BDT+0x50): CDC bulk TX — data forwarded to chardev.
 */
static void usb_check_cdc_bdt(PIC32MKUSBState *s)
{
    hwaddr bdt = usb_bdt_phys(s);
    if (!bdt) {
        return;
    }

    /*
     * EP1-IN = CDC Serial State Notification (interrupt IN, 16 bytes max).
     * BDT: EP1-IN-even = BDT+0x30, EP1-IN-odd = BDT+0x38.
     * Drain and return to firmware without forwarding to chardev.
     */
    for (int ppbi = 0; ppbi < 2; ppbi++) {
        hwaddr ep1_in = bdt + 0x30u + (ppbi ? 8u : 0u);
        uint8_t entry[8];
        cpu_physical_memory_read(ep1_in, entry, 8);

        uint32_t ctrl = le32_to_cpu(*(uint32_t *)entry);
        if (!(ctrl & BDT_UOWN)) {
            continue;
        }

        /* Return BDT entry: TOK_PID=IN, UOWN=0, preserve bc */
        ctrl = (ctrl & 0xFFFF0000u) | 0x24u;
        *(uint32_t *)entry = cpu_to_le32(ctrl);
        cpu_physical_memory_write(ep1_in, entry, 8);

        /* UxSTAT: EP=1(bits[7:4]=0x10), DIR=IN(bit3=0x08), PPBI=ppbi(bit2) */
        usb_stat_fifo_push(s, 0x18u | (uint32_t)(ppbi ? 0x04u : 0x00u));
        usb_update_irq(s);
        break;   /* one notification per tick is enough */
    }

    /*
     * EP2-IN = CDC bulk TX.  BDT: EP2-IN-even = BDT+0x50, EP2-IN-odd = BDT+0x58.
     * Forward data to chardev backend (PTY / socket / file).
     */
    for (int ppbi = 0; ppbi < 2; ppbi++) {
        hwaddr ep2_in = bdt + 0x50u + (ppbi ? 8u : 0u);
        uint8_t entry[8];
        cpu_physical_memory_read(ep2_in, entry, 8);

        uint32_t ctrl = le32_to_cpu(*(uint32_t *)entry);
        if (!(ctrl & BDT_UOWN)) {
            continue;
        }

        uint32_t bc   = ctrl >> 16;
        uint32_t addr = le32_to_cpu(*(uint32_t *)(entry + 4));

        if (bc > 0 && addr) {
            uint8_t txbuf[64];
            bc = MIN(bc, sizeof(txbuf));
            cpu_physical_memory_read(addr, txbuf, bc);
            if (qemu_chr_fe_backend_connected(&s->chr)) {
                qemu_chr_fe_write_all(&s->chr, txbuf, bc);
            }
        }

        /* Return BDT entry: TOK_PID=IN, UOWN=0, preserve bc */
        ctrl = (ctrl & 0xFFFF0000u) | 0x24u;
        *(uint32_t *)entry = cpu_to_le32(ctrl);
        cpu_physical_memory_write(ep2_in, entry, 8);

        /* UxSTAT: EP=2(bits[7:4]=0x20), DIR=IN(bit3=0x08), PPBI=ppbi(bit2) */
        usb_stat_fifo_push(s, 0x28u | (uint32_t)(ppbi ? 0x04u : 0x00u));
        usb_update_irq(s);
        return;   /* drain one packet per tick; FIFO handles concurrency */
    }
}

/*
 * EP0 enumeration timer
 * -----------------------------------------------------------------------
 */

static void usb_timer_cb(void *opaque)
{
    PIC32MKUSBState *s = opaque;

    /* Standard USB SETUP packets for enumeration sequence */
    static const uint8_t setup_get_dev_desc[8] = {
        0x80, 0x06, 0x00, 0x01, 0x00, 0x00, 18, 0x00
    };  /* GET_DESCRIPTOR(Device, length=18) */

    static const uint8_t setup_set_address[8] = {
        0x00, 0x05, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00
    };  /* SET_ADDRESS(1) */

    static const uint8_t setup_get_cfg_desc[8] = {
        0x80, 0x06, 0x00, 0x02, 0x00, 0x00, 67, 0x00
    };  /* GET_DESCRIPTOR(Configuration, length=67) */

    static const uint8_t setup_set_config[8] = {
        0x00, 0x09, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00
    };  /* SET_CONFIGURATION(1) */

    switch (s->ep0_sim) {

    case EP0_SIM_IDLE:
        /* Do nothing until USBPWR is set */
        break;

    case EP0_SIM_RESET:
        /*
         * Wait until firmware enables URSTIE (bit 0) in UIE.
         * The UIE write handler fires URSTIF immediately when URSTIE is first
         * enabled (edge-detected).  This path is a poll fallback: if URSTIE
         * is already set by the time we arrive here, fire now; otherwise retry
         * every 5ms.  The 50ms initial delay usually isn't long enough for the
         * Harmony stack to complete Init→Attach→EnableInterrupts.
          */
        if (!(s->uie & USB_IR_URSTIF)) {
            /*
             * SESSION_VALID fallback: if the initial SESVDIF pulse was missed
             * (e.g. IEC not enabled yet when pulse fired), re-latch SESVDIF
             * every few retries so the EVIC can deliver the interrupt once
             * IEC is enabled.
              */
            s->sesvd_retry_count++;
            /*
             * Only re-latch if firmware has never acknowledged SESVDIF.
             * Once sesvd_acked is true, the Attach→URSTIE chain has
             * started and retries would cause an IRQ storm.
              */
            if (!s->sesvd_acked &&
                (s->sesvd_retry_count % 3) == 0 &&
                (s->otgstat & USB_OTG_IR_SESSION_VALID) &&
                (s->otgie & USB_OTG_IR_SESSION_VALID)) {
                s->otgir |= USB_OTG_IR_SESSION_VALID;
                s->sesvd_edge_latched = true;
                usb_update_irq(s);
            }
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 5 * SCALE_MS);
            return;
        }
        s->uir |= USB_IR_URSTIF;
        usb_update_irq(s);
        s->ep0_sim = EP0_SIM_GET_DEV_DESC;
        timer_mod(s->usb_timer,
                  qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 10 * SCALE_MS);
        return;

    case EP0_SIM_GET_DEV_DESC:
        if (usb_inject_setup(s, setup_get_dev_desc)) {
            s->ep0_sim = EP0_SIM_WAIT_DEV_DESC;
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 5 * SCALE_MS);
        } else {
            /* Retry every 2 ms until BDT is armed */
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 2 * SCALE_MS);
        }
        return;

    case EP0_SIM_WAIT_DEV_DESC:
        /* Consume the EP0-IN response(s) — may be multi-packet (64+3 bytes) */
        if (usb_accept_ep0_in(s)) {
            /* Give firmware 2ms to re-arm IN or finish */
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 2 * SCALE_MS);
        } else {
            /* IN response not ready yet, or we just consumed last packet */
            usb_send_status_out(s);  /* status phase complete */
            s->ep0_sim = EP0_SIM_SET_ADDRESS;
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 5 * SCALE_MS);
        }
        return;

    case EP0_SIM_SET_ADDRESS:
        if (usb_inject_setup(s, setup_set_address)) {
            s->uaddr = 1;   /* pretend host acknowledged new address */
            s->ep0_sim = EP0_SIM_WAIT_ADDRESS;
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 5 * SCALE_MS);
        } else {
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 2 * SCALE_MS);
        }
        return;

    case EP0_SIM_WAIT_ADDRESS:
        /* Consume status-phase ZLP IN from SET_ADDRESS */
        if (usb_accept_ep0_in(s)) {
            s->ep0_sim = EP0_SIM_GET_CFG_DESC;
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 5 * SCALE_MS);
        } else {
            /* Retry */
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 2 * SCALE_MS);
        }
        return;

    case EP0_SIM_GET_CFG_DESC:
        if (usb_inject_setup(s, setup_get_cfg_desc)) {
            s->ep0_sim = EP0_SIM_WAIT_CFG_DESC;
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 5 * SCALE_MS);
        } else {
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 2 * SCALE_MS);
        }
        return;

    case EP0_SIM_WAIT_CFG_DESC:
        /* May be multi-packet; keep accepting until no more IN pending */
        if (usb_accept_ep0_in(s)) {
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 2 * SCALE_MS);
        } else {
            usb_send_status_out(s);  /* status phase */
            s->ep0_sim = EP0_SIM_SET_CONFIG;
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 5 * SCALE_MS);
        }
        return;

    case EP0_SIM_SET_CONFIG:
        if (usb_inject_setup(s, setup_set_config)) {
            s->ep0_sim = EP0_SIM_WAIT_CONFIG;
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 5 * SCALE_MS);
        } else {
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 2 * SCALE_MS);
        }
        return;

