patchew-project/qemu/hw/mips/pic32mk_usb.c
    case EP0_SIM_WAIT_CONFIG:
        /* Consume status-phase ZLP IN from SET_CONFIGURATION */
        if (usb_accept_ep0_in(s)) {
            s->configured = true;
            s->ep0_sim = EP0_SIM_DONE;
            qemu_log_mask(LOG_UNIMP, "pic32mk_usb: USB enumeration DONE\n");
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 5 * SCALE_MS);
        } else {
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 2 * SCALE_MS);
        }
        return;

    case EP0_SIM_DONE:
        /*
         * Poll CDC TX every 1 ms (was 5 ms — too slow for bootloader
         * throughput; each WRITE command needs a response drained from
         * EP2-IN before the firmware can process the next one).
          */
        usb_check_cdc_bdt(s);
        /* Advance the frame counter (1 frame = 1 ms at full-speed) */
        {
            uint32_t frm = ((s->ufrmh & 0x07u) << 8) | s->ufrml;
            frm = (frm + 1) & 0x7FFu;
            s->ufrml = frm & 0xFFu;
            s->ufrmh = (frm >> 8) & 0x07u;
        }
        timer_mod(s->usb_timer,
                  qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 1 * SCALE_MS);
        return;
    }
}

/*
 * MMIO read
 * -----------------------------------------------------------------------
 */

static uint64_t usb_read(void *opaque, hwaddr addr, unsigned size)
{
    PIC32MKUSBState *s = opaque;
    hwaddr base = addr & ~(hwaddr)0xFu;   /* strip sub-register bits */

    switch (base) {
    /* OTG block */
    case PIC32MK_UxOTGIR:
        return s->otgir;
    case PIC32MK_UxOTGIE:
        return s->otgie;
    case PIC32MK_UxOTGSTAT:
        return s->otgstat;
    case PIC32MK_UxOTGCON:
        return s->otgcon;
    case PIC32MK_UxPWRC:
        return s->pwrc;

    /* Core registers */
    case PIC32MK_UxIR:
        return s->uir;
    case PIC32MK_UxIE:
        return s->uie;
    case PIC32MK_UxEIR:
        return s->ueir;
    case PIC32MK_UxEIE:
        return s->ueie;
    case PIC32MK_UxSTAT:
        return s->ustat;
    case PIC32MK_UxCON:
        return s->ucon;
    case PIC32MK_UxADDR:
        return s->uaddr;
    case PIC32MK_UxBDTP1:
        return s->bdtp1;
    case PIC32MK_UxFRML:
        return s->ufrml;
    case PIC32MK_UxFRMH:
        return s->ufrmh;
    case PIC32MK_UxTOK:
        return s->utok;
    case PIC32MK_UxSOF:
        return s->usof;
    case PIC32MK_UxBDTP2:
        return s->bdtp2;
    case PIC32MK_UxBDTP3:
        return s->bdtp3;
    case PIC32MK_UxCNFG1:
        return s->cnfg1;

    default:
        break;
    }

    /* Endpoint control registers UxEP0–UxEP15 */
    if (base >= PIC32MK_UxEP_BASE &&
        base < PIC32MK_UxEP_BASE + PIC32MK_USB_NEPS * PIC32MK_UxEP_STRIDE) {
        unsigned ep = (base - PIC32MK_UxEP_BASE) / PIC32MK_UxEP_STRIDE;
        return s->uep[ep];
    }

    qemu_log_mask(LOG_UNIMP,
                  "pic32mk_usb: unimplemented read @ 0x%04" HWADDR_PRIx "\n",
                  addr);
    return 0;
}

/*
 * MMIO write
 * -----------------------------------------------------------------------
 */

static void usb_write(void *opaque, hwaddr addr, uint64_t val, unsigned size)
{
    PIC32MKUSBState *s = opaque;
    hwaddr base = addr & ~(hwaddr)0xFu;
    int    sub  = (int)(addr & 0xFu);
    uint32_t v  = (uint32_t)val;

    switch (base) {

    /* ----- OTG block ----- */
    case PIC32MK_UxOTGIR:
        /*
         * Clear the edge latch before W1C so that usb_update_irq() deasserts
         * the IRQ line when SESVDIF is cleared by firmware.
          */
        if (v & USB_OTG_IR_SESSION_VALID) {
            s->sesvd_edge_latched = false;
            s->sesvd_acked = true;   /* firmware processed SESSION_VALID */
        }
        apply_w1c(&s->otgir, v, sub);
        usb_update_irq(s);
        return;

    case PIC32MK_UxOTGIE: {
        uint32_t old_otgie = s->otgie;
        apply_sci(&s->otgie, v, sub);
        /*
         * SESSION_VALID edge simulation:
         * Latch SESVDIF ONLY on the 0→1 transition of the SESSION_VALID enable
         * bit, and only if firmware hasn't already acknowledged it.  Without
         * edge detection, any OTGIE write (e.g. Harmony's Attach() enabling
         * all OTG ints from inside the SESSION_VALID ISR) would re-latch
         * SESVDIF and cause an infinite ISR loop.
          */
        if (!(old_otgie & USB_OTG_IR_SESSION_VALID) &&
            (s->otgie & USB_OTG_IR_SESSION_VALID) &&
            (s->otgstat & USB_OTG_IR_SESSION_VALID) &&
            !s->sesvd_acked) {
            s->otgir |= USB_OTG_IR_SESSION_VALID;
            s->sesvd_edge_latched = true;
            fprintf(stderr, "pic32mk_usb: SESSION_VALID latched → IRQ (persistent)\n");
        }
        usb_update_irq(s);
        return;
    }

    case PIC32MK_UxOTGSTAT:
        return;   /* read-only */

    case PIC32MK_UxOTGCON:
        apply_sci(&s->otgcon, v, sub);
        return;

    case PIC32MK_UxPWRC: {
        uint32_t old_pwrc = s->pwrc;
        apply_sci(&s->pwrc, v, sub);
        /* When USBPWR first asserted: schedule USB Reset after 50 ms */
        if ((s->pwrc & USB_PWRC_USBPWR) && !(old_pwrc & USB_PWRC_USBPWR)
            && s->ep0_sim == EP0_SIM_IDLE) {
            fprintf(stderr, "pic32mk_usb: USBPWR set — scheduling USB Reset in 50ms\n");
            s->ep0_sim = EP0_SIM_RESET;
            timer_mod(s->usb_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 50 * SCALE_MS);
        }
        return;
    }

    /* ----- Core interrupt registers ----- */
    case PIC32MK_UxIR:
        /*
         * TRNIF W1C: pop the USTAT FIFO.  On real PIC32MK hardware, clearing
         * TRNIF advances the 4-deep STAT FIFO.  If more entries remain,
         * TRNIF is re-asserted immediately with the next USTAT value, so the
         * Harmony ISR's while(TRNIF) loop processes all queued transactions.
         */
        if (v & USB_IR_TRNIF) {
            usb_stat_fifo_pop(s);
        }
        apply_w1c(&s->uir, v, sub);
        /*
         * Opportunistic CDC TX check: firmware just cleared TRNIF, meaning it
         * finished processing a transaction.  If it also armed EP2-IN (TX
         * response) during that processing, drain it NOW instead of waiting
         * for the next timer tick.  This brings TX latency close to zero.
         */
        if (s->configured) {
            usb_check_cdc_bdt(s);
        }
        usb_update_irq(s);
        return;

    case PIC32MK_UxIE: {
        uint32_t old_uie = s->uie;
        apply_sci(&s->uie, v, sub);
        /*
         * When firmware enables URSTIE (bit 0) for the first time and the EP0
         * state machine is armed (USBPWR was set earlier), fire URSTIF now.
         * On real hardware the host drives USB Reset after D+ pullup is seen.
         * We use the same edge-detection pattern as SESSION_VALID: pulse assert
         * + deassert so EVIC latches IFS exactly once, then let usb_update_irq
         * handle the persistent URSTIF level (UIR & UIE != 0).
          */
        if (!(old_uie & USB_IR_URSTIF) && (s->uie & USB_IR_URSTIF)
            && s->ep0_sim == EP0_SIM_RESET) {
            fprintf(stderr, "pic32mk_usb: URSTIE enabled → firing USB Reset\n");
            s->uir |= USB_IR_URSTIF;
        }
        usb_update_irq(s);
        return;
    }

    case PIC32MK_UxEIR:
        apply_w1c(&s->ueir, v, sub);
        usb_update_irq(s);
        return;

