patchew-project/qemu/hw/mips/pic32mk_usb.c
    case PIC32MK_UxEIE:
        apply_sci(&s->ueie, v, sub);
        usb_update_irq(s);
        return;

    case PIC32MK_UxSTAT:
        return;   /* read-only */

    case PIC32MK_UxCON:
        apply_sci(&s->ucon, v, sub);
        return;

    case PIC32MK_UxADDR:
        apply_sci(&s->uaddr, v, sub);
        return;

    case PIC32MK_UxBDTP1:
        apply_sci(&s->bdtp1, v, sub);
        return;

    case PIC32MK_UxFRML:
    case PIC32MK_UxFRMH:
        return;   /* read-only */

    case PIC32MK_UxTOK:
        apply_sci(&s->utok, v, sub);
        return;

    case PIC32MK_UxSOF:
        apply_sci(&s->usof, v, sub);
        return;

    case PIC32MK_UxBDTP2:
        apply_sci(&s->bdtp2, v, sub);
        return;

    case PIC32MK_UxBDTP3:
        apply_sci(&s->bdtp3, v, sub);
        return;

    case PIC32MK_UxCNFG1:
        apply_sci(&s->cnfg1, v, sub);
        return;

    default:
        break;
    }

    /* Endpoint control registers */
    if (base >= PIC32MK_UxEP_BASE &&
        base < PIC32MK_UxEP_BASE + PIC32MK_USB_NEPS * PIC32MK_UxEP_STRIDE) {
        unsigned ep = (base - PIC32MK_UxEP_BASE) / PIC32MK_UxEP_STRIDE;
        apply_sci(&s->uep[ep], v, sub);
        return;
    }

    qemu_log_mask(LOG_UNIMP,
                  "pic32mk_usb: unimplemented write @ 0x%04" HWADDR_PRIx
                  " = 0x%08x\n", addr, v);
}

static const MemoryRegionOps usb_ops = {
    .read       = usb_read,
    .write      = usb_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
    },
};

/*
 * Device lifecycle
 * -----------------------------------------------------------------------
 */

static void pic32mk_usb_reset(DeviceState *dev)
{
    PIC32MKUSBState *s = PIC32MK_USB(dev);

    /* Reset values: all zero unless specified in DS60001519E §25 */
    s->otgir   = 0;
    s->otgie   = 0;
    /*
     * SESVD (bit 3): simulate VBUS present from power-on.
     * The Harmony driver polls PLIB_USB_OTG_SessionValid() (reads SESVD) to
     * decide whether to call USB_DEVICE_Attach().  If SESVD=0 at boot the
     * driver never calls Attach(), USBPWR is never set, and our timer-based
     * EP0 simulation never starts — a permanent deadlock.  Pre-setting SESVD
     * breaks the cycle: firmware sees VBUS valid, calls Attach(), sets USBPWR,
     * and our EP0 timer fires as expected.
      */
    s->otgstat = 0x08u;
    s->otgcon  = 0;
    s->pwrc    = 0;
    s->uir     = 0;
    s->uie     = 0;
    s->ueir    = 0;
    s->ueie    = 0;
    s->ustat   = 0;
    s->ucon    = 0;
    s->uaddr   = 0;
    s->bdtp1   = 0;
    s->bdtp2   = 0;
    s->bdtp3   = 0;
    s->ufrml   = 0;
    s->ufrmh   = 0;
    s->utok    = 0;
    s->usof    = 0x4Bu;
    s->cnfg1   = 0;
    memset(s->uep, 0, sizeof(s->uep));

    s->ep0_sim   = EP0_SIM_IDLE;
    s->configured = false;
    s->sesvd_edge_latched = false;
    s->sesvd_acked = false;
    s->sesvd_retry_count = 0;

    /* USTAT FIFO reset */
    memset(s->stat_fifo, 0, sizeof(s->stat_fifo));
    s->stat_fifo_head  = 0;
    s->stat_fifo_tail  = 0;
    s->stat_fifo_count = 0;

    if (s->usb_timer) {
        timer_del(s->usb_timer);
    }

    qemu_set_irq(s->irq, 0);
}

static void pic32mk_usb_init(Object *obj)
{
    PIC32MKUSBState *s = PIC32MK_USB(obj);

    memory_region_init_io(&s->sfr_mmio, obj, &usb_ops, s,
                          TYPE_PIC32MK_USB, PIC32MK_USB_SFR_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->sfr_mmio);
    sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->irq);

    s->usb_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL, usb_timer_cb, s);
    s->ep0_sim   = EP0_SIM_IDLE;
    s->configured = false;
    s->sesvd_edge_latched = false;
    s->sesvd_acked = false;
    s->sesvd_retry_count = 0;
    s->stat_fifo_head  = 0;
    s->stat_fifo_tail  = 0;
    s->stat_fifo_count = 0;
}

static void pic32mk_usb_realize(DeviceState *dev, Error **errp)
{
    PIC32MKUSBState *s = PIC32MK_USB(dev);
    if (qemu_chr_fe_backend_connected(&s->chr)) {
        qemu_chr_fe_set_handlers(&s->chr,
                                 usb_chr_can_receive,
                                 usb_chr_receive,
                                 NULL, NULL,
                                 s, NULL, true);
    }
}

static const Property pic32mk_usb_properties[] = {
    DEFINE_PROP_CHR("chardev", PIC32MKUSBState, chr),
};

static void pic32mk_usb_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    device_class_set_legacy_reset(dc, pic32mk_usb_reset);
    device_class_set_props(dc, pic32mk_usb_properties);
    dc->realize = pic32mk_usb_realize;
    dc->desc = "PIC32MK USB OTG Full-Speed";
}

static const TypeInfo pic32mk_usb_info = {
    .name          = TYPE_PIC32MK_USB,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(PIC32MKUSBState),
    .instance_init = pic32mk_usb_init,
    .class_init    = pic32mk_usb_class_init,
};

static void pic32mk_usb_register_types(void)
{
    type_register_static(&pic32mk_usb_info);
}

type_init(pic32mk_usb_register_types)
